// Программа GameOver_3.0

#include <iostream>
using std::cout;
using std::endl;

int main()
{
    cout << "Hello World!" << endl;
    return 0;
}

// В этой версии мы пишем два объявления:
// using std::cout;
// using std::endl;

// Я объяняю программе какие именно объекты я собираюсь использовать в программе.
// Преимущество заключается в следующем: сразу точно известно, с какими элементами я собираюсь работать.
// Кроме того, в таком случае не становятся локальными всевозможные другие элементы, которые нам не нужны.

